Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: ```typescript // Generate a time-based key for our record const rkey = TID.nextStr()
ja: ```typescript // 時間ベースのレコードキーを生成します const rkey = TID.nextStr()

source: ```typescript await agent.com.atproto.repo.getRecord({ repo: agent.assertDid, // The user collection: 'app.bsky.actor.profile', // The collection rkey: 'self', // The record key }) ```
ja: ```typescript await agent.com.atproto.repo.getRecord({ repo: agent.assertDid, // ユーザー collection: 'app.bsky.actor.profile', // コレクション rkey: 'self', // レコードキー }) ```

source: ```typescript const migrations: Record<string, Migration> = { "001": {} // existing migrations for auth tables "002": { async up(db: Kysely<unknown>) { await db.schema .createTable("account") .addColumn("did", "text", (col) => col.primaryKey()) .addColumn("handle", "text", (col) => col.notNull()) .addColumn("active", "integer", (col) => col.notNull().defaultTo(1)) .execute();
ja: ```typescript const migrations: Record<string, Migration> = { "001": {} // 認可テーブル用の既存migration "002": { async up(db: Kysely<unknown>) { await db.schema .createTable("account") .addColumn("did", "text", (col) => col.primaryKey()) .addColumn("handle", "text", (col) => col.notNull()) .addColumn("active", "integer", (col) => col.notNull().defaultTo(1)) .execute();

source: ```typescript export async function getAccountHandle(did: string): Promise<string | null> { const db = getDb(); // if we've tracked to the account through Tap and gotten their account info, we'll load from there const account = await db .selectFrom("account") .select("handle") .where("did", "=", did) .executeTakeFirst(); if (account) return account.handle; // otherwise we'll resolve the accounts DID through Tap which provides identity caching try { const didDoc = await getTap().resolveDid(did); if (!didDoc) return null; return getHandle(didDoc) ?? null; } catch { return null; } }
ja: ```typescript export async function getAccountHandle(did: string): Promise<string | null> { const db = getDb(); // 追跡対象アカウントでアカウント情報を取得済みの場合、それを読み込みます const account = await db .selectFrom("account") .select("handle") .where("did", "=", did) .executeTakeFirst(); if (account) return account.handle; // それ以外の場合は、IDキャッシュを提供するTapを通じてDIDを解決します try { const didDoc = await getTap().resolveDid(did); if (!didDoc) return null; return getHandle(didDoc) ?? null; } catch { return null; } }

source: ```typescript interface ProfileRecord { displayName?: string // a human friendly name description?: string // a short bio avatar?: BlobRef // small profile picture banner?: BlobRef // banner image to put on profiles createdAt?: string // declared time this profile data was added // ... } ```
ja: ```typescript interface ProfileRecord { displayName?: string // 人間にわかりやすい名前 description?: string // 短いアカウント説明 avatar?: BlobRef // 小さなプロフィール画像 Banner?: BlobRef // プロフィール画面に表示するバナー画像 createdAt?: string // このプロフィールデータが追加された時刻（自称） // ... } ```

source: `adultOnly` which is boolean
ja: `adultOnly`属性はブール値です

source: `array`: may have elements of heterogeneous type, because of the flexibility Lexicon unions provide.
ja: `array`：Lexiconの共用体が提供する柔軟性のため、型が異なる要素を持つ可能性があります。

source: `blob`: the `ref` must be a valid `cid-link`, and have `raw` multicodec (not `dag-cbor`). `size` may not be negative. `mimeType` can not be an empty string. The "legacy" blob format should be supported for reading, but new records created must be the regular blob format. Note that supprting additional reference types (eg, alternative multicodecs or hash types) are a likely evolution and extension point for the protocol in the future, but the current version of the repository and data model is narrowly defined.
ja: `blob`：`ref`は有効な`cid-link`である必要があり、`raw` multicodec（`dag-cbor`ではない）を持つ必要があります。`size`は負の値であってはいけません。`mimeType`は空の文字列であってはいけません。レガシーblob形式は読み取りでサポートされるべきですが、作成される新しいレコードは通常のblob形式である必要があります。追加の参照形式（例えば、別のmulticodecまたはハッシュタイプ）をサポートすることは、将来のプロトコルの進化と拡張の可能性としてありえますが、現在のバージョンではリポジトリとデータモデルは狭く定義されています。

source: `blurs` which may be `content` or `media` or `none`
ja: `blurs`属性は`content`、`media`、または`none`になりえます

source: `bytes`: may be empty (length 0)
ja: `bytes`：空（長さ0）を許します

source: `cid-link`: as discussed in the protocol specification: must be CIDv1; multibase should be raw in CBOR encoding (type `0x00`); multicodec should be `dag-cbor` (`0x71`) or `raw` (`0x55`); and multihash type SHA-256 is encouraged (but not strictly required)
ja: `cid-link`：プロトコル仕様で説明されている通りです。CIDv1である必要があります。multibaseではCBORエンコーディングはraw（type `0x00`）です。multicodecは`dag-cbor`（`0x71`）または`raw`（`0x55`）である必要があります。multihashはSHA-256が推奨されています（ただし厳密には必須ではありません）。

source: `defaultSetting` which may be `hide` or `warn` or `ignore`
ja: `defaultSetting`属性は`hide`、`warn`、または`ignore`になりえます

source: `goat` can be installed from [Homebrew](https://formulae.brew.sh/formula/goat) on macOS and Linux:
ja: `goat`はmacOSとLinuxで[Homebrew](https://formulae.brew.sh/formula/goat)からインストールできます。

source: `graphic-media` which behaves like `porn` but is for violence / gore.
ja: `graphic-media`は`porn`と同じ挙動ですが、暴力/流血のためのものです。

source: `integer`: should have values within safe limits (discussed in limits section)
ja: `integer`：制限内の値を持つべきです（制限セクションで説明）

source: `lexicons.json` - manifest tracking installed Lexicons and their versions (CIDs)
ja: `lexicons.json` - インストールされたLexiconとそのバージョン（CID）を追跡するマニフェスト

source: `lexicons/` - directory containing the Lexicon JSON files
ja: `lexicons/` - Lexicon JSONファイルを含むディレクトリ

source: `nudity` which puts a warning on images but isn't 18+ and defaults to ignore.
ja: `nudity`は画像に警告を置きますが、18歳以上専用ではなく、デフォルトでは無視されます。

source: `object`: key must all be strings, and follow similar data requirements to `string` fields. Empty key strings are not allowed. Key names starting with `$` are reserved for protocol use (for example, `$bytes` and `$type`)
ja: `object`：キーはすべて文字列である必要があり、`string`フィールドと同様の要件に従います。空のキー文字列は許可されていません。`$`で始まるキー名はプロトコル使用のために予約されています（例えば、`$bytes`および`$type`）

source: `porn` which puts a warning on images and can only be clicked through if the user is 18+ and has enabled adult content.
ja: `porn`は画像に警告を置き、ユーザーが18歳以上かつアダルトコンテンツを有効にしている場合にのみクリックできます。

source: `required` fields can not be made optional or deprecated under the evolution rules
ja: `required`フィールドは進化ルールの下では、オプション化または廃止することはできません

source: `severity` which may be `alert` or `inform` or `none`
ja: `severity`属性は`alert`、`inform`、または`none`になりえます

source: `sexual` which behaves like `porn` but is meant to handle less intense sexual content.
ja: `sexual`は`porn`と同じ挙動ですが、それほど過激ではない性的コンテンツに使われることを目的としています。

source: `stateStore` is temporary storage using during the OAuth flow; `sessionStore` is persistent storage keyed by a user's DID. The `globalThis` pattern is a standard Next.js technique for persisting data across hot module reloads in development. Without this, the in-memory stores would be wiped every time you edit a file.
ja: `stateStore`はOAuthフロー中に使う一時ストレージ、`sessionStore`はユーザーDIDをキーにした永続ストレージです。`globalThis`パターンは、開発中のホットリロードをまたいでデータを保持するためのNext.jsの定番手法です。これがないと、ファイル編集のたびにインメモリストアが消えます。

source: `string`: must be valid UTF-8 encoding. No particular Unicode normalization is expected or required. Empty strings are allowed, but it is preferred to take advantage of nullable or optional fields if possible.
ja: `string`：有効なUTF-8エンコーディングである必要があります。特定のUnicode正規化は期待も要求もされません。空の文字列は許可されていますが、可能であればnullableまたはオプションフィールドを活用することが推奨されます。

source: `subjectTypes`, `subjectCollections`, and `reasonTypes` declare what type of moderation reports are reviewed by the Labeler. `subjectTypes` can include `record` for individual pieces of content, and `account` for overall accounts. `subjectCollections` is a list of NSIDs of record types; if not defined, any record type is allowed. `reasonTypes` is a list of report reason codes (Lexicon references).
ja: `subjectTypes`、`subjectCollections`、`reasonTypes`は、ラベラーが受け付ける報告のタイプを宣言します。`subjectTypes`は個別のコンテンツが対象の場合は`record`、アカウント全体が対象の場合は`account`を含めることができます。`subjectCollections`はレコードの型を示すNSIDのリストです。定義されていない場合は、任意の型のレコードが許可されます。`reasonTypes`は報告理由コードのリスト（Lexicon参照）です。

source: `tap` simplifies AT sync by handling the firehose connection, verification, backfill, and filtering. Your application connects to a Tap and receives simple JSON events for only the repos and collections you care about, no need to worry about binary formats for validating cryptographic signatures.
ja: `tap`はfirehose接続、検証、バックフィル、フィルタリングを処理することでAT同期を簡素化します。アプリケーションはTapに接続し、あなたが関心のあるリポジトリとコレクションのみのシンプルなJSONイベントを受け取ります。署名検証のためのバイナリ形式について心配する必要はありません。

source: `text` and `createdAt` are required values under the [`app.bsky.feed.post` Lexicon](https://atproto.blue/en/latest/atproto/atproto_client.models.app.bsky.feed.post.html).
ja: `text`と`createdAt`は[`app.bsky.feed.post` Lexicon](https://atproto.blue/en/latest/atproto/atproto_client.models.app.bsky.feed.post.html)において必須の値です。

source: a good default is `application/json` with the schema being an object with no defined properties
ja: 良いデフォルトは`application/json`で、スキーマはプロパティ定義のないオブジェクトです

source: a message
ja: メッセージ

source: ability to filter by collection (NSID) or repo (DID)
ja: コレクション（NSID）またはリポジトリ（DID）でフィルタリングする機能

source: all core message types include a `seq` field (integer). The `seq` of messages increases monotonically, though may have gaps.
ja: すべてのコアメッセージタイプに`seq`フィールド（整数）が含まれます。メッセージの`seq`は単調に増加しますが、ギャップがある場合があります。

source: an unknown labeler
ja: 不明なラベラー

source: and
ja: および

source: any downstream services (eg, AppViews) should update local account status for the account.
ja: 下流サービス（例：AppView）はローカルのアカウント状態を更新します。

source: any service which does not have any current repo content for the account (eg, because it was previously deleted) may fetch a repo [CAR](/specs/repository#car-file-serialization) export and process it as a background tasks. An “upstream” host (like a relay) may have a repo copy, or the service might connect directly to the account's PDS host. They are not required to do so, and might instead wait for a `#commit` event.
ja: 対象アカウントの最新のコンテンツを持っていないサービス（過去に削除してしまった等）は、リポジトリの[CAR](/specs/repository#car-file-serialization)エクスポートを取得し、バックグラウンドタスクで処理することがあります。（リレーのような）上流のホストはリポジトリのコピーを持っているかもしれませんし、サービスがそのアカウントのPDSに直接接続するかもしれません。これは必須ではなく、代わりに`#commit`イベントを待つこともあります。

source: await client.delete(app.bsky.feed.post, { rkey: '3jxf7z2k3q2', }) ``` </TabPanel> <TabPanel value="go"> To delete a record, like an individual post, use `RepoDeleteRecord():` ```go comatproto.RepoDeleteRecord(ctx, client, &comatproto.RepoDeleteRecord_Input{ Repo: client.Auth.Did, // handle or DID Collection: "app.bsky.feed.post", // lexicon Rkey: "3mbl5xdw4yk2r", // rkey }) ``` </TabPanel> </TabPanels> </TabGroup>
ja: await client.delete(app.bsky.feed.post, { rkey: '3jxf7z2k3q2', }) ``` </TabPanel> <TabPanel value="go"> 個々の投稿などのレコードを削除するには、`RepoDeleteRecord()`を使用します。 ```go comatproto.RepoDeleteRecord(ctx, client, &comatproto.RepoDeleteRecord_Input{ Repo: client.Auth.Did, // handle or DID Collection: "app.bsky.feed.post", // lexicon Rkey: "3mbl5xdw4yk2r", // rkey }) ``` </TabPanel> </TabPanels> </TabGroup>

source: await client.put(app.bsky.actor.profile, { displayName: 'New Name', description: 'Updated bio', }) ``` </TabPanel> <TabPanel value="go"> To update an existing record, like a user's profile, use `RepoPutRecord()`:
ja: await client.put(app.bsky.actor.profile, { displayName: 'New Name', description: 'Updated bio', }) ``` </TabPanel> <TabPanel value="go"> ユーザーのプロフィールなど既存のレコードを更新するには、`RepoPutRecord()`を使用します。

source: click here
ja: こちらをクリック

source: const server = await serve(router, { port: 3000 }) console.log('Server listening on port 3000') ``` </TabPanel> <TabPanel value="go"> In Go, you can implement HTTP endpoints manually:
ja: const server = await serve(router, { port: 3000 }) console.log('Server listening on port 3000') ``` </TabPanel> <TabPanel value="go"> GoではHTTPエンドポイントを手動で実装できます。

source: ctx := context.Background() ``` Import the SDK libraries and go directly to [making requests](/guides/reading-data)!
ja: ctx := context.Background() ``` SDKライブラリをインポートしたら、そのまま[リクエストの作成](/guides/reading-data)に進みましょう。

source: diffing, linting, and verifying schema evolution rules
ja: スキーマの差分比較、lint、およびスキーマ進化ルールの検証

source: do not mark data fields or API parameters as `required` unless they are truly required for functionality
ja: データフィールドまたはAPIパラメータが機能に真に必須でない限り、`required`としてマークしないでください

source: downstream services (eg, AppView) **should** immediately stop serving/distributing content for the account. They *may* defer permanent data deletion according to local policy. Updating aggregations (eg, record counts) may also be deferred or processed in a background queue according to policy and implementation. Error status messages may indicate either that the content is "gone" (existed, but no longer available), or that content is "not found" (not revealing that content existed previously)
ja: 下流のサービス（例：AppView）は即座にそのアカウントのコンテンツ提供や配布を止め**なければいけません**。恒久的なデータ削除はポリシーによって延期する*かもしれません*。集計（例：レコード数）の更新もポリシーや実装によって遅れたりバックグラウンドキューで処理されるかもしれません。エラーメッセージは"gone"（存在するが利用できない）か"not found"（過去に存在したことも明かさない）を示すかもしれません。

source: downstream services (eg, AppView) should update their identity cache, and increment the account's `rev` (when the `#commit` is received), but otherwise don't need to take any action.
ja: 下流サービス（例：AppView）は自身のIDキャッシュを更新し、（`#commit`受信時に）そのアカウントの`rev`を増加させたら、それ以外は何もする必要はありません。

source: downstream services (eg, AppViews) should make content unavailable, but do not need to delete data locally. They should indicate account/content status as "unavailable"; best practice is to specifically indicate that this is due to account deactivation.
ja: 下流サービス（例：AppView）はコンテンツを利用不可にしますが、ローカルから削除する必要はありません。対象のアカウントやコンテンツのステータスとして"unavailable"を示します。ベストプラクティスは、アカウント無効化によるものだと提示することです。

source: downstream services process and pass through these events.
ja: 下流のサービスはこれらのイベントを処理し、パススルーします。

source: e.g. Alice Lastname
ja: 例：山田 太郎

source: e.g. Great Posters
ja: 例：重要な投稿をするユーザー

source: e.g. Spammers
ja: 例: スパマー

source: e.g. The posters who never miss.
ja: 例: 絶対に投稿を見逃してはならないユーザー。

source: e.g. Users that repeatedly reply with ads.
ja: 例: 繰り返し広告付きで返信するユーザー。

source: e.g. alice
ja: 例：太郎

source: e.g. alice.com
ja: 例：example.com

source: eg `app.bsky.feed.*` , `app.bsky.graph.*`
ja: 例：`app.bsky.feed.*`、`app.bsky.graph.*`

source: eg `app.bsky.feed.defs`
ja: 例：`app.bsky.feed.defs`

source: eg `app.bsky.feed.post#main` vs `app.bsky.feed.post.main`, or `com.example.record#foo` and `com.example.record.foo`
ja: 例：`app.bsky.feed.post#main`に対する`app.bsky.feed.post.main`や、`com.example.record#foo`と`com.example.record.foo`の共存

source: eg `getPost`, `listLikes`, `putProfile`
ja: 例：`getPost`、`listLikes`、`putProfile`

source: eg `post`, `like`, `profile`
ja: 例：`post`、`like`、`profile`

source: eg `subscribeLabels`
ja: 例：`subscribeLabels`

source: eg, avoid using `default` or `length` as schema names
ja: 例：スキーマ名に`default`や`length`を使わない

source: eg, include `.temp.` or `.unspecced.` in the NSID hierarchy
ja: 例：NSIDの階層に`.temp.`または`.unspecced.`を含める

source: export async function POST(request: NextRequest) { // Verify request is from our TAP server if (TAP_ADMIN_PASSWORD) { const authHeader = request.headers.get("Authorization"); if (!authHeader) { return NextResponse.json({ error: "Unauthorized" }, { status: 401 }); } try { assureAdminAuth(TAP_ADMIN_PASSWORD, authHeader); } catch { return NextResponse.json({ error: "Unauthorized" }, { status: 401 }); } }
ja: export async function POST(request: NextRequest) { // 自分のTAPサーバーからのリクエストであることを検証 if (TAP_ADMIN_PASSWORD) { const authHeader = request.headers.get("Authorization"); if (!authHeader) { return NextResponse.json({ error: "Unauthorized" }, { status: 401 }); } try { assureAdminAuth(TAP_ADMIN_PASSWORD, authHeader); } catch { return NextResponse.json({ error: "Unauthorized" }, { status: 401 }); } }

source: export const header = { title: 'AT Protocol', description: 'The AT Protocol is an open, decentralized, and high-performance network for building social applications.', }
ja: export const header = { title: 'ATプロトコル', description: 'ATプロトコルは、ソーシャルアプリケーションを構築するためのオープンで分散型の高性能ネットワークです。', }

source: export const header = { title: 'ATProto for distributed systems engineers', description: 'AT Protocol is the tech developed at Bluesky for open social networking. In this article we\'re going to explore AT Proto from the perspective of distributed backend engineering.', }
ja: export const header = { title: '分散システムエンジニアのためのATプロトコル', description: 'ATプロトコルは、Blueskyでオープンソーシャルネットワーキング用に開発された技術です。この記事では、分散バックエンドエンジニアリングの観点からATプロトコルについて説明します。', }

source: export const header = { title: 'ATProto for distributed systems engineers', description: 'In this article we\'re going to explore AT Proto from the perspective of distributed backend engineering.', date: 'Sep 3, 2024', }
ja: export const header = { title: '分散システムエンジニアのためのatproto', description: 'この記事では、分散バックエンドエンジニアリングの観点からatprotoについて説明します。', }

source: export const header = { title: 'Account Migration', description: 'Migrating an account to a new PDS', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'アカウント移行', description: '新しいPDSへアカウントを移行する', }

source: export const header = { title: 'Accounts and deletions', description: 'How account lifecycles and deletions work in AT Protocol', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'アカウントと削除', description: 'ATプロトコルでアカウントのライフサイクルと削除がどのように機能するか', }

source: export const header = { title: 'Atproto Ethos', description: 'A deep dive into the philosophical and aesthetic principles underlying the design of AT Protocol.', date: 'Apr 4, 2025' }
ja: export const header = { title: 'atprotoの基本理念', description: 'ATプロトコルの設計を支える哲学的・美学的原則を深掘りする', date: 'Apr 4, 2025' }

source: export const header = { title: 'Auth', description: 'Auth for AT Protocol application developers', }
ja: export const header = { title: '認証', description: 'ATプロトコルアプリケーション開発者向けの認証ガイド', }

source: export const header = { title: 'Auth', description: 'Auth for Atproto application developers', }
ja: export const header = { title: '認可', description: 'atprotoアプリケーション開発者向けの認可ガイド', }

source: export const header = { title: 'Backfilling', description: 'Replicating the network', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'バックフィル', description: 'ネットワークを複製する', }

source: export const header = { title: 'Blob Lifecycle', description: 'How blobs are uploaded, referenced, and deleted', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'blobライフサイクル', description: 'blobのアップロード、参照、削除の方法', }

source: export const header = { title: 'Blob Security', description: 'Security considerations when serving blobs', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'blobのセキュリティ', description: 'blobを取り扱う際のセキュリティの考慮事項', }

source: export const header = { title: 'Build an Agent', description: 'Create a bot that automatically posts on Bluesky', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'エージェント作成', description: 'Blueskyに自動投稿するボットの作成', }

source: export const header = { title: 'Create a Social App', description: 'Build an app that lets you broadcast and receive status updates using AT Record Lexicons.', }
ja: export const header = { title: 'ソーシャルアプリの作成', description: 'ATレコードLexiconを使用してステータス更新をブロードキャストおよび受信できるアプリを構築', }

source: export const header = { title: 'Creating a Labeler', description: 'Run your own modular moderation service', }
ja: export const header = { title: 'ラベラーの作成', description: 'あなた自身のモジュラーモデレーションサービスを実行する', }

source: export const header = { title: 'FAQ', description: 'Frequently Asked Questions about AT Protocol.', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'FAQ', description: 'ATプロトコルに関するよくある質問', }

source: export const header = { title: 'Feeds', description: 'Creating and consuming custom feed generators', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'フィード', description: 'カスタムフィードジェネレーターの作成と利用', }

source: export const header = { title: 'Glossary of terms', description: 'A collection of terminology used in the AT Protocol and their definitions.', }
ja: import {Heading} from '@/components/Heading' export const header = { title: '用語集', description: 'ATプロトコルで使用される用語とその定義のコレクション', }

source: export const header = { title: 'Going to production', description: 'Improving your Atmosphere stack deployment for production use at scale', }
ja: import {Heading} from '@/components/Heading' export const header = { title: '本番環境への移行', description: 'スケール環境での本番運用に向けたAtmosphereスタックデプロイメントの改善', }

source: export const header = { title: 'Identity', description: 'How the AT Protocol handles user identity.', }
ja: export const header = { title: 'Identity', description: 'ATプロトコルがユーザーIDを処理する方法', }

source: export const header = { title: 'Images and Video', description: 'Working with image and video blobs', }
ja: import {Heading} from '@/components/Heading' export const header = { title: '画像と動画', description: '画像と動画blobの活用', }

source: export const header = { title: 'Installing Lexicons', description: 'Using Lexicons in your dev environment', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'Lexiconのインストール', description: '開発環境におけるLexiconの利用', }

source: export const header = { title: 'Labels', description: 'All about moderation labels', }
ja: export const header = { title: 'ラベル', description: 'モデレーションラベルに関する全て', }

source: export const header = { title: 'Lexicon Style Guide', description: 'A style guide for creating new ATProto Lexicons', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'Lexiconスタイルガイド', description: 'ATプロトコルのLexicon作成のためのスタイルガイド', }

source: export const header = { title: 'Lexicons', description: 'A schema-driven interoperability framework', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'Lexicon', description: 'スキーマによる相互運用性フレームワーク', }

source: export const header = { title: 'Moderation', description: 'Moderation in the Atmosphere', }
ja: export const header = { title: 'モデレーション', description: 'Atmosphereのモデレーション', }

source: export const header = { title: 'OAuth Patterns', description: 'OAuth implementation examples', }
ja: export const header = { title: 'OAuthパターン集', description: 'OAuthの実装例', }

source: export const header = { title: 'OAuth with NextJS Tutorial', description: 'Build a Next.js app supporting OAuth with ATProto identity.', }
ja: export const header = { title: 'NextJSでOAuthチュートリアル', description: 'atproto IDによるOAuthに対応したNext.jsアプリの作成', }

source: export const header = { title: 'Permission Requests', description: 'A permissions guide for app developers and Lexicon designers', }
ja: export const header = { title: '権限リクエスト', description: 'アプリ開発者とLexicon設計者のための権限ガイド', }

source: export const header = { title: 'Personal Data Repositories', description: 'A guide to the AT Protocol repo structure.', }
ja: export const header = { title: '個人データリポジトリ', description: 'ATプロトコルのリポジトリ構造のガイド', }

source: export const header = { title: 'Protocol Overview', description: 'An introduction to the AT Protocol.', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'プロトコル概要', description: 'ATプロトコルの紹介', }

source: export const header = { title: 'Publishing Lexicons', description: 'Sharing your lexicons with the world', }
ja: import {Heading} from '@/components/Heading' export const header = { title: 'Lexiconの公開', description: 'Lexiconを世界と共有する', }
